import 'easy/01.dart';

void main(List<String> arguments) {
  ///do this solving in 9/26,hard to understand why these people from leetcode can have so smart brain.Also i want to know the reason why the world's best programing languages can be so hard to be used in leetcode.
  // print(isPalindrome(1429669241)); //---->>> 09.dart => 回文数（不允许使用字符串）

  //do these two solving in 9/27,反转链表比第一次要熟练一点，虽然还是没办法一遍写出来答案，但是看答案时有种一下子就明白的感觉，希望下次再写的时候，可以熟练很多。 024 => 反转链表
  //关于快慢指针找出中间点的solution，感觉也很熟悉，可能是因为太久没刷题，所以出现了问题。 143 => 重排链表，先后再前。

  //do 453 => 最小操作次数使数组元素相等 in 9/28,属于脑筋急转弯类型的题目，不过思路很巧妙啦。

  //do 665 => 非递减数列 in 9/28,关于这道题，我一开始进入了思考的误区，我一直在考虑是改变唯一的数，其实只要想通思维并不难，这种题目重在多刷。
  // print(checkPossibility([1, 2, 3, 4, 5, 6, 7, 8, 9, 2, 12, 3, 19]));

  //do 283 =>  移动零 in 9/29，把所有的非0移到最前面，再把后面的数依次补零。

  //do 118 =>  杨辉三角形 in 9/30,杨辉三角形，之前做过好几次，所以这次比较容易就写出来了。

  //do 661 =>  均值滤波 in 10/2, 相当于卷积，写的很优雅。
  // List a = imageSmoother([
  //   [100, 200, 100],
  //   [200, 50, 200],
  //   [100, 200, 100]
  // ]);
  // print(a.toString());

  //do 598 => 范围求和 II in 10/4, 脑筋急转弯题目，意义不大。

  //do 419 => 甲板上的战舰 in 10/5,遍历的同时，只考虑单个点的问题。
  // print(countBattleships([
  //   ["X", "X", "X"]
  // ]));

  //do 189 => 轮转数组 in 10/6,取余运算的同时，考虑循环点的问题。

  //do 396 => 旋转函数 in 10/7,一道很巧妙的题目，但是很简单，10分钟内ak。
  // print(maxRotateFunction([4, 3, 2, 6]));

  //do 54 => 螺旋矩阵 in 10/8,纯模拟题，只需要根据题目要求模拟就好，难的是处理边界情况。
  // print(spiralOrder([
  //   [1, 2, 3, 4],
  //   [5, 6, 7, 8],
  //   [9, 10, 11, 12]
  // ]));

  //do 59 => 螺旋矩阵 II in 10/9,模拟题，和上一题一样。
  // print(generateMatrix(5));

  //do 498 => 对角线遍历 in 10/10,模拟题，但是很难，虽然看了solution后就明白了，但是依然感觉自己有一个鸿沟需要去跨越。
  // print(findDiagonalOrder([
  //   [1, 2, 3],
  //   [4, 5, 6],
  //   [7, 8, 9]
  // ]));

  // do 48 => 旋转图像 in 10/16,停了很多天，时间安排不太合理，这题比较简单，属于找规律的题目，但处理点位置的方法值得多次学习。

  // do 73 => 矩阵置零 in 10/16,5分钟ak

  // do 289 => 生命游戏 in 10/17,很难的题目，做不出来，思路比较巧妙。

  // do 464 => 我能赢吗 in 11/9,博弈论+状态压缩，思路极其巧妙

  // do 100 => 相同的树 in 12/2,简单递归。

  // do 101 => 对称二叉树 in 12/2

  // do 102 => 二叉树的层序遍历 in 12/2

  // do 103 => 二叉树锯齿层序遍历 in 12/5, 队列Queue的使用。

  // do 104 => 二叉树的深度 in 12/5,递归使用。

  // do 105 => 从前序与中序遍历序列构造二叉树 in 12/5,依然递归，需要了解前序，中序，后序的概念。

  // dp 106 => 中序与后序遍历序列构造二叉树 in 12/5

  // do 107 => 二叉树的层序遍历 II in 12/5

  // do 108 => 将有序数组转换为二叉搜索树 in 12/6

  // do 109 => 将有序链表转换二叉搜索树 in 12/6

  // do 110 => 平衡二叉树 in 12/6

  // do 111 => 二叉树的最小深度 in 12/10,递归方法。

  // do 剑指09 => 用两个栈实现队列 in 1/14,简单构造。

  // do 剑指30 => 包含min函数的栈 in 1/15，简单构造栈。

  // do 剑指06 => 从尾到头打印链表 in 1/16,打印链表。

  // do 剑指24 => 翻转链表 in 1/17,翻转链表。

  // do 01 => 两数之和 in 4/28 
}
